apps/recruit_test-master/app/controllers/api/subscriptions_controller.rb

SELECT  `plans`.* FROM `plans` WHERE `plans`.`id` = 4 LIMIT 1
---
  def convert_currency
  	to = currency_params[:target_currency].upcase
  	@plan = Plan.find(currency_params[:target_plan])